; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite1 Phenomenon5)
	(pointing satellite2 Star11)
	(have_image Phenomenon5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Star7 thermograph2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 thermograph2)
	(have_image Star11 thermograph2)
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star11 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star11)
   goals met: 1 of 13
2. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 13
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 13
4. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 1 of 13
5. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 1 of 13
6. (take_image satellite1 planet10 instrument3 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 2 of 13
7. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 13
8. (take_image satellite1 phenomenon9 instrument3 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 3 of 13
9. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 13
10. (take_image satellite1 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 13
11. (turn_to satellite1 phenomenon12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 13
13. (take_image satellite1 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 6 of 13
14. (turn_to satellite1 planet13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet13)
   goals met: 6 of 13
15. (take_image satellite1 planet13 instrument3 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 7 of 13
16. (turn_to satellite1 planet6 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet6)
   goals met: 7 of 13
17. (take_image satellite1 planet6 instrument3 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 8 of 13
18. (turn_to satellite1 star11 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star11)
   goals met: 8 of 13
19. (take_image satellite1 star11 instrument3 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 9 of 13
20. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 9 of 13
21. (take_image satellite1 star14 instrument3 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 10 of 13
22. (turn_to satellite1 star7 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star7)
   goals met: 10 of 13
23. (take_image satellite1 star7 instrument3 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 11 of 13
24. (turn_to satellite1 phenomenon5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon5)
   goals met: 12 of 13
25. (take_image satellite1 phenomenon5 instrument3 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 13 of 13
